{
  "label": {
    "hi": "Hi,",
    "iAm": "I am",
    "fullStackDeveloper": "Full stack developer",
    "contactMe": "Contact Me",
    "aboutMe": "About me",
    "aboutMeDescription": "I’m a software engineering student at the Faculty of Organizational Sciences in Belgrade and currently working at Marble IT, where I'm sharpening my skills on real-world, enterprise-level projects. While I’m gaining invaluable experience in full-stack development through my day job, I’m also open to freelance opportunities that let me explore new ideas, technologies, and creative challenges. My entrepreneurial spirit keeps me curious and motivated—I’m all about building practical, user-friendly solutions (with as few bugs as possible, promise). Whether I’m writing backend logic or perfecting UI details, I bring a lot of energy, fresh ideas, and yes, probably too much coffee. I believe the best results come from great collaboration, so if you’ve got a project that needs passion, reliability, and a bit of flair—I’m in.",
    "experience": "Experience",
    "marbleExperience": "Software Engineer at MarbleIT (2025-)",
    "marbleExperienceDescription": "I am currently employed at Marble IT, where I contribute to the development of a comprehensive ERP system designed primarily for the City Administration of Zurich. This project focuses on modernizing and automating various municipal processes, including finance, human resources, and public services management. The backend is built with ASP.NET Core Web API, while the frontend uses Angular to provide an intuitive and responsive user interface. My role involves implementing core functionalities, ensuring seamless data flow between modules, and maintaining high standards of security through role-based access control. Additionally, I work on optimizing database operations with MSSQL to improve system efficiency. This experience has enhanced my understanding of large-scale enterprise applications and strengthened my full-stack development skills in a real-world, high-impact environment.",
    "idealWeddingExperience": "Full stack developer at Idealno Venčanje (2023-2025)",
    "idealWeddingExperienceDescription": "I had the privilege of contributing to the development of a wedding planning web application startup, where I was mentored by an experienced senior developer. This opportunity allowed me to learn invaluable best practices and gain deep insights into building robust, scalable applications. The project was built using Angular for the frontend and ASP.NET Core Web API for the backend, with an MSSQL database at its core. One of the highlights was implementing real-time communication through SignalR, where I developed a web chat feature to enhance user engagement. Additionally, I had the chance to deploy the project on Azure, leveraging Azure Table Storage for managing media assets like images and videos. Throughout this project, I also worked with a variety of powerful libraries, including Leaflet for mapping, LightGallery for image galleries, and Swiper for sleek, responsive carousels, all contributing to an intuitive and dynamic user experience.",
    "fonboardExperience": "Front-end developer at FonBoard (2023-2025)",
    "fonboardExperienceDescription": "For the past two years, I’ve had the privilege of working as one of the lead front-end developers on a web application designed to connect companies with students through job listings and applications. The project was developed with Angular on the frontend, Nest for the backend, and PostgreSQL as the database. During this time, I had the opportunity to lead pull request reviews, ensuring code quality and best practices. Additionally, I played a key role in refactoring the project from the ground up, optimizing both performance and maintainability. This experience not only sharpened my technical skills but also allowed me to foster collaboration and mentorship within the team, driving the project towards greater success. ",
    "fonisExperience": "FONIS - Association of Information Technology Students at FON(2023 - 2024)",
    "fonisExperienceDescription": "I had the opportunity to serve as the team leader for a group of 7 students, where we worked together on developing a website for the Companies to Students (C2S) project. While the project itself wasn’t highly complex, it gave me valuable experience in leading a team of developers and managing the workflow. I set up and organized our Jira and BitBucket projects, ensuring smooth and efficient collaboration through well-defined processes. The project’s main challenge was implementing robust form validation, as it involved multiple parts with intricate dependencies. This experience helped me hone my leadership skills and deepened my understanding of project management and development best practices.",
    "projects": "Projects",
    "plean": "PLEAN",
    "pleanDescription": "PLEAN is a cloud-based ERP system that streamlines core business operations",
    "idealWedding": "Ideal Wedding",
    "idealWeddingDescription": "A web planning platform for efficient wedding planning",
    "fonboard": "FonBoard",
    "fonboardDescription": "A student engagement platform for seamless job application",
    "brandedGames": "Branded Games",
    "brandedGamesDescription": "A web platform for personal game customization",
    "companiesToStudents": "Companies to Students",
    "companiesToStudentsDescription": "A website for student organization, event - Companies to Students",
    "iAmNotHardToFind": "I am not hard to find,",
    "letsCreateSomething": "let’s create something",
    "truly": "truly",
    "getInTouchOrShootMeAnEmail": "Get in touch or shoot me an email directly at:",
    "youCanContactMeAt": "You can contact me at:",
    "close": "Close",
    "readMore": "Read more"
  },
  "errors": {
    "RequestInvalid": "",
    "Unauthorized": "",
    "RequirementsNotMet": "",
    "IdentityError": "{{details}}",
    "EntityDoesNotExist": "{{entityName}} does not exist.",
    "EntityAlreadyExists": "{{entityName}} already exists.",
    "InternalServerError": "{{details}}",
    "InvalidCredentials": "Invalid credentials.",
    "EmptyFile": "",
    "MaxFileSizeReached": "Couldn't upload. Maximum file size is {{maxSizeInMb}} MB.",
    "CanOnlyUploadPhotos": "Image load failed. Unsupported media type or corrupted file.",
    "WrongAspectRatio": "",
    "MissingAspectRatio": "",
    "EmailNotSent": "Unexpected error, we couldn't send the email, try again later.",
    "AlreadyConfirmedEmail": "This email address has already been confirmed",
    "InvalidConfirmationCode": "This confirmation code is invalid",
    "InvalidGoogleAccount": "This Google account isn't valid, register first.",
    "ConfirmationCodeExpired": "This confirmation code has expired.",
    "Name is required.": "Name is required."
  },
  "confirmMessages": {

  },
  "placeholders": {

  }
}
